Revit 2027 API
ParameterTypeId.StairsSupportVerticalOffset Property
 "Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupportVerticalOffset { get; }
Public Shared ReadOnly Property StairsSupportVerticalOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupportVerticalOffset {
	ForgeTypeId^ get ();
}
static member StairsSupportVerticalOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace